[
  {
    "id": "1",
    "name": "Chinook",
    "image": "/images/chinook.png",
    "otherNames": "Spring, King, Tyee",
    "latinName": "Oncorhynchus tschawytscha",
    "appearance": "Small eyes, Black gums, Small round spots on its back, dorsal fin and tail, thick caudal",
    "averageWeight": "9 kg (20 lbs)",
    "averageSize": "56 cm - 81 cm (22 inches - 32 inches)",
    "lifeCycle": "4 - 7 years",
    "funFact1": "Chinook migrate upstream from the spring through the fall as far as 1,500 kilometres (932 miles) inland. Chinook fry may go to sea soon after hatching, or after one to two years in fresh water.",
    "funFact2": "They are sometimes called 'spring salmon' because they return to rivers earlier than other Pacific salmon species to spawn.",
    "funFact3": "Due to their size, Chinook are a primary prey species for Southern Resident killer whales, an endangered population.",
    "funFact4": "Chinook are the biggest Pacific salmon, sometimes reaching lengths of over 4 feet and weighing up to 129 pounds. "
  },
  {
    "id": "2",
    "name": "Coho",
    "image": "/images/coho.png",
    "otherNames": "Silver, Medium-red (when canned)",
    "latinName": "Oncorhynchus kisutch",
    "averageWeight": "2 kg - 5.5 kg (4 lbs - 12 lbs)",
    "averageSize": "56 cm - 66 cm (22 inches - 26 inches)",
    "lifeCycle": "3 years",
    "appearance": "White gums, spots above lateral line and on upper lobe, thick caudal, Silver color adjacent to caudal",
    "funFact1": "There are more distinct populations of coho salmon in BC than any other Pacific salmon species.",
    "funFact2": "Coho salmon migrate some distance inland and spawn in the smaller tributaries of larger rivers, including the Fraser, Skeena, Bella-Coola, Nass, and Taku rivers.",
    "funFact3": "Adult coho usually return to fresh water between late summer and early fall. Most choose streams close to the ocean, although some will journey as far as 1,500 kilometres (932 miles) inland. Young coho fry are different than the other salmon species as they stay in their spawning stream for a full year after they emerge from the gravel.",
    "funFact4": "Juvenile coho defend their territories through a series of maneuvers including a complex shimmy-shake, dubbed by scientists the 'wig-wag dance'. "
  },
  {
    "id": "3",
    "name": "Chum",
    "image": "/images/chum.png",
    "otherNames": "Silver-bright, Keta (when canned)",
    "latinName": "Oncorhynchus keta",
    "averageWeight": "3.5 kg (8 lbs)",
    "averageSize": "56 cm - 66 cm (22 inches - 26 inches)",
    "lifeCycle": "3 - 5 years",
    "appearance": "Dark metallic blue-green back with silver sides and belly, large pupil, no spots, narrow caudal",
    "funFact1": "Chum salmon generally spawn in late fall and usually in the lower tributaries along the coast, rarely more than 150 kilometres (93 miles) inland. Fry emerge in the spring and go directly to sea.",
    "funFact2": "Chum salmon have a tiger stripe pattern of red and black stripes when they enter fresh water. ",
    "funFact3": "Chum salmon spawn in over 880 medium-sized rivers and streams in BC and the Yukon. ",
    "funFact4": "Chum salmon leave their birth streams quickly for the ocean as young adults."
  },
  {
    "id": "4",
    "name": "Pink",
    "image": "/images/pink.png",
    "otherNames": "Humpback, Humpie",
    "latinName": "Oncorhynchus gorbusha",
    "averageWeight": "2 kg (4 lbs)",
    "averageSize": "35 cm - 46 cm (14 inches - 18 inches)",
    "lifeCycle": "2 years",
    "appearance": "Shiny silvery skin, Large black oval spots on the back and tail, develop a hump on their back when spawning, very small scales",
    "funFact1": "Pink salmon fry migrate to the sea as soon as they emerge from the gravel and live almost their entire two years in ocean feeding areas. Adults leave the ocean in the late summer and early fall and usually spawn in streams, not fed by lakes, that are a short distance from the sea.",
    "funFact2": "Pink salmon are the smallest of the Pacific salmon found in North America. They weigh between 3.5 and 5 pounds, and are 20 to 25 inches long. ",
    "funFact3": "Pink salmon have the shortest lifespan of all Pacific salmon, completing their life cycle in just two years. ",
    "funFact4": "Pink salmon hatch in freshwater streams and rivers, then migrate to the ocean to feed and grow. "
  },
  {
    "id": "5",
    "name": "Sockeye",
    "image": "/images/sockeye.png",
    "otherNames": "Red Salmon (when canned)",
    "latinName": "Oncorhynchus nerka",
    "averageWeight": "2.7 kg (6 lbs)",
    "averageSize": "51 cm – 61 cm (20 inches – 24 inches)",
    "lifeCycle": "5 years",
    "appearance": "Small black speckles on its deep blue-green back and silver sides, No spots on the tail, Slender and firm body, Develop a bright red body and green head when spawning, Large and distinct scales.",
    "funFact1": "Sockeye spawn in streams with lakes in their watershed and stay in those lakes for one to three years before migrating to sea. They move rapidly out of the estuaries and thousands of miles into the Gulf of Alaska and North Pacific Ocean where they feed. They return to their spawning stream when they are three to, at times, even six years old.",
    "funFact2": "The name sockeye may come from the Coast Salish word 'sukkai'",
    "funFact3": "The Fraser, Skeena, Nass, Stikine, Taku, and Alsek watersheds are major spawning grounds for sockeye salmon. ",
    "funFact4": "Sockeye salmon only spawn once in their lives, and die shortly after."
  }
]
